; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	satellite2 - satellite
	instrument5 - instrument
	satellite3 - satellite
	instrument6 - instrument
	satellite4 - satellite
	instrument7 - instrument
	satellite5 - satellite
	instrument8 - instrument
	satellite6 - satellite
	instrument9 - instrument
	instrument10 - instrument
	instrument11 - instrument
	satellite7 - satellite
	instrument12 - instrument
	instrument13 - instrument
	instrument14 - instrument
	satellite8 - satellite
	instrument15 - instrument
	instrument16 - instrument
	instrument17 - instrument
	thermograph0 - mode
	infrared1 - mode
	infrared2 - mode
	Star1 - direction
	Star0 - direction
	Star2 - direction
	GroundStation3 - direction
	GroundStation4 - direction
	Phenomenon5 - direction
	Planet6 - direction
	Phenomenon7 - direction
	Planet8 - direction
	Phenomenon9 - direction
	Star10 - direction
)
(:init
	(supports instrument0 thermograph0)
	(supports instrument0 infrared2)
	(calibration_target instrument0 GroundStation4)
	(supports instrument1 infrared2)
	(supports instrument1 thermograph0)
	(calibration_target instrument1 Star1)
	(supports instrument2 infrared2)
	(supports instrument2 infrared1)
	(calibration_target instrument2 Star2)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon7)
	(supports instrument3 infrared2)
	(supports instrument3 thermograph0)
	(calibration_target instrument3 Star2)
	(supports instrument4 thermograph0)
	(supports instrument4 infrared2)
	(calibration_target instrument4 GroundStation4)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star1)
	(supports instrument5 infrared1)
	(calibration_target instrument5 Star1)
	(on_board instrument5 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Phenomenon5)
	(supports instrument6 infrared2)
	(supports instrument6 thermograph0)
	(supports instrument6 infrared1)
	(calibration_target instrument6 Star2)
	(on_board instrument6 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star0)
	(supports instrument7 thermograph0)
	(calibration_target instrument7 Star2)
	(on_board instrument7 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Phenomenon7)
	(supports instrument8 thermograph0)
	(calibration_target instrument8 GroundStation3)
	(on_board instrument8 satellite5)
	(power_avail satellite5)
	(pointing satellite5 Phenomenon5)
	(supports instrument9 infrared1)
	(calibration_target instrument9 Star1)
	(supports instrument10 infrared1)
	(supports instrument10 infrared2)
	(calibration_target instrument10 GroundStation4)
	(supports instrument11 thermograph0)
	(supports instrument11 infrared2)
	(calibration_target instrument11 Star0)
	(on_board instrument9 satellite6)
	(on_board instrument10 satellite6)
	(on_board instrument11 satellite6)
	(power_avail satellite6)
	(pointing satellite6 Phenomenon7)
	(supports instrument12 infrared2)
	(supports instrument12 infrared1)
	(supports instrument12 thermograph0)
	(calibration_target instrument12 GroundStation4)
	(supports instrument13 infrared2)
	(calibration_target instrument13 GroundStation4)
	(supports instrument14 infrared2)
	(supports instrument14 infrared1)
	(calibration_target instrument14 Star2)
	(on_board instrument12 satellite7)
	(on_board instrument13 satellite7)
	(on_board instrument14 satellite7)
	(power_avail satellite7)
	(pointing satellite7 Phenomenon7)
	(supports instrument15 infrared1)
	(supports instrument15 thermograph0)
	(supports instrument15 infrared2)
	(calibration_target instrument15 GroundStation3)
	(supports instrument16 infrared2)
	(supports instrument16 thermograph0)
	(supports instrument16 infrared1)
	(calibration_target instrument16 GroundStation4)
	(supports instrument17 thermograph0)
	(supports instrument17 infrared1)
	(calibration_target instrument17 GroundStation4)
	(on_board instrument15 satellite8)
	(on_board instrument16 satellite8)
	(on_board instrument17 satellite8)
	(power_avail satellite8)
	(pointing satellite8 Planet6)
)
(:goal (and
	(pointing satellite1 Phenomenon5)
	(pointing satellite2 Star2)
	(pointing satellite3 Star2)
	(pointing satellite7 Planet6)
	(pointing satellite8 Star1)
	(have_image Phenomenon5 thermograph0)
	(have_image Planet6 infrared1)
	(have_image Phenomenon7 infrared2)
	(have_image Planet8 thermograph0)
	(have_image Phenomenon9 thermograph0)
	(have_image Star10 infrared2)
))

)

; plan
1. (turn_to satellite7 groundstation4 phenomenon7)
   deleted: (pointing satellite7 phenomenon7)
   added: (pointing satellite7 groundstation4)
   goals met: 0 of 11
2. (switch_on instrument12 satellite7)
   deleted: (power_avail satellite7)
   added: (power_on instrument12)
   goals met: 0 of 11
3. (calibrate satellite7 instrument12 groundstation4)
   added: (calibrated instrument12)
   goals met: 0 of 11
4. (turn_to satellite7 phenomenon9 groundstation4)
   deleted: (pointing satellite7 groundstation4)
   added: (pointing satellite7 phenomenon9)
   goals met: 0 of 11
5. (take_image satellite7 phenomenon9 instrument12 thermograph0)
   added: (have_image phenomenon9 thermograph0)
   goals met: 1 of 11
6. (turn_to satellite7 phenomenon7 phenomenon9)
   deleted: (pointing satellite7 phenomenon9)
   added: (pointing satellite7 phenomenon7)
   goals met: 1 of 11
7. (take_image satellite7 phenomenon7 instrument12 infrared2)
   added: (have_image phenomenon7 infrared2)
   goals met: 2 of 11
8. (turn_to satellite7 phenomenon5 phenomenon7)
   deleted: (pointing satellite7 phenomenon7)
   added: (pointing satellite7 phenomenon5)
   goals met: 2 of 11
9. (turn_to satellite3 star2 star0)
   deleted: (pointing satellite3 star0)
   added: (pointing satellite3 star2)
   goals met: 3 of 11
10. (turn_to satellite2 star2 phenomenon5)
   deleted: (pointing satellite2 phenomenon5)
   added: (pointing satellite2 star2)
   goals met: 4 of 11
11. (turn_to satellite1 phenomenon5 star1)
   deleted: (pointing satellite1 star1)
   added: (pointing satellite1 phenomenon5)
   goals met: 5 of 11
12. (take_image satellite7 phenomenon5 instrument12 thermograph0)
   added: (have_image phenomenon5 thermograph0)
   goals met: 6 of 11
13. (turn_to satellite7 planet8 phenomenon5)
   deleted: (pointing satellite7 phenomenon5)
   added: (pointing satellite7 planet8)
   goals met: 6 of 11
14. (take_image satellite7 planet8 instrument12 thermograph0)
   added: (have_image planet8 thermograph0)
   goals met: 7 of 11
15. (turn_to satellite7 star10 planet8)
   deleted: (pointing satellite7 planet8)
   added: (pointing satellite7 star10)
   goals met: 7 of 11
16. (take_image satellite7 star10 instrument12 infrared2)
   added: (have_image star10 infrared2)
   goals met: 8 of 11
17. (turn_to satellite7 planet6 star10)
   deleted: (pointing satellite7 star10)
   added: (pointing satellite7 planet6)
   goals met: 9 of 11
18. (take_image satellite7 planet6 instrument12 infrared1)
   added: (have_image planet6 infrared1)
   goals met: 10 of 11
19. (turn_to satellite8 star1 planet6)
   deleted: (pointing satellite8 planet6)
   added: (pointing satellite8 star1)
   goals met: 11 of 11
